sessin/app/controllers/user_controller.rb

INSERT INTO "users" ("created_at", "last_login", "updated_at", "password_salt", "login_count", "password_hash", "email") VALUES('2010-09-04 20:24:09', NULL, '2010-09-04 20:24:09', 'FwAxNwy0UJ', NULL, 'ca20fd4d81ca77606a1d76faa9a0864f91e92b95', 'amitamb@gmail.com')
---
	def signup
		@title = "Signup"
		if request.post? and params[:user]
			@user = User.new(params[:user])
			if @user.save