sessin/app/controllers/web_session_controller.rb

	def index
		current_user = User.find(session[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)